In [176]:
#Import all relevant libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
#import seaborn as sns
#from scipy.stats import zscore
 
## This statement allows the visuals to render within your Jupyter Notebook.
%matplotlib inline

## Loading the data
We can now load the dataset into pandas using the read_csv() function. This converts the CSV file into a Pandas dataframe.

In [177]:
TimesHigher = pd.read_csv("data/TIMES_WorldUniversityRankings_2024.csv")
shanghaiRanking = pd.read_csv("data/shanghai_ranking_2024.csv")
df = pd.read_csv("data/univercity_ranking_2014_2024_CWUR.csv") # to store all data
WordRankUniversity = df[df['Year'] == 2024].reset_index()  # Filter by 2024

### Viewing the dataframe
We can get a quick sense of the size of our dataset by using the shape method. This returns a tuple with the number of rows and columns in the dataset.

#### TimesHigher

- stats_number_students: The total number of students enrolled at the university.
- stats_student_staff_ratio: The ratio of students to academic staff, reflecting teaching capacity.
- stats_pc_intl_students: The percentage of international students enrolled, showing global

In [178]:
TimesHigher.head()

,rank,name,scores_overall,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,...,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,closed,unaccredited,disabled,website_url
0,1,University of Oxford,98.5,10,96.6,5,100.0,2,99.0,5,...,"21,750",10.9,42%,49 : 51,University of Oxford,"Geography,Chemistry,Chemical Engineering,Biolo...",False,False,False,https://www.timeshighereducation.com/student/r...
1,2,Stanford University,98.0,20,99.0,1,97.8,8,99.6,2,...,"14,517",6.4,23%,47 : 53,Stanford University,"Computer Science,Communication & Media Studies...",False,False,False,NaN
2,3,Massachusetts Institute of Technology,97.9,30,98.6,2,96.2,11,99.7,1,...,"11,085",8.0,33%,41 : 59,Massachusetts Institute of Technology,"Architecture,Economics & Econometrics,Archaeol...",False,False,False,https://www.timeshighereducation.com/student/r...
3,4,Harvard University,97.8,40,97.7,3,99.9,3,99.4,3,...,"20,050",9.0,25%,51 : 49,Harvard University,"Sociology,Architecture,Physics & Astronomy,Psy...",False,False,False,https://www.timeshighereducation.com/student/r...
4,5,University of Cambridge,97.5,50,95.8,7,100.0,1,98.0,12,...,"20,565",11.5,38%,48 : 52,University of Cambridge,Politics & International Studies (incl Develop...,False,False,False,https://www.timeshighereducation.com/student/r...

In [179]:
TimesHigher.columns

Index(['rank', 'name', 'scores_overall', 'scores_overall_rank',
       'scores_teaching', 'scores_teaching_rank', 'scores_research',
       'scores_research_rank', 'scores_citations', 'scores_citations_rank',
       'scores_industry_income', 'scores_industry_income_rank',
       'scores_international_outlook', 'scores_international_outlook_rank',
       'record_type', 'member_level', 'url', 'nid', 'location',
       'stats_number_students', 'stats_student_staff_ratio',
       'stats_pc_intl_students', 'stats_female_male_ratio', 'aliases',
       'subjects_offered', 'closed', 'unaccredited', 'disabled',
       'website_url'],
      dtype='object')

In [180]:
TimesHigher.shape

(2673, 29)

#### shanghaiRanking

- The global rank of the university


- University_Name
The name of the university or higher education institution being ranked.


- National/Regional Rank
The rank of the university within its respective country or region.


- Alumni
The score related to the number of alumni who have won Nobel Prizes or Fields Medals.


- Award
The score reflecting the number of staff at the university who have won Nobel Prizes in specified fields or Fields Medals.


- Hici
The score based on the number of Highly Cited Researchers affiliated with the university,


- N&S
The score representing the number of research articles published in Nature and Science between 2019 and 2023.


- PUB
The score indicating the number of papers published by the university in the Science Citation Index-Expanded™ (SCIE) and Social Science Citation Index™ (SSCI) during 2023.


- PCP
The Per Capita Performance score, calculated by dividing the weighted scores of the five indicators

In [181]:

shanghaiRanking.head()

,Rank,University_Name,National/Regional Rank,Alumni,Award,Hici,N&S,PUB,PCP
0,1,Harvard University,1,100.0,97.1,100.0,100.0,100.0,85.7
1,2,Stanford University,2,45.3,88.1,73.1,83.9,73.1,59.6
2,3,Massachusetts Institute of Technology (MIT),3,71.9,82.8,55.2,70.8,59.1,73.6
3,4,University of Cambridge,1,78.2,90.8,45.1,59.8,67.2,60.6
4,5,"University of California, Berkeley",4,65.3,76.5,46.9,62.8,57.1,55.5

In [182]:
shanghaiRanking.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    1000 non-null   object
 1   University_Name         1000 non-null   object
 2   National/Regional Rank  1000 non-null   object
 3   Alumni                  1000 non-null   float64
 4   Award                   1000 non-null   float64
 5   Hici                    1000 non-null   float64
 6   N&S                     989 non-null    float64
 7   PUB                     1000 non-null   float64
 8   PCP                     1000 non-null   float64
dtypes: float64(6), object(3)
memory usage: 70.4+ KB

In [183]:
shanghaiRanking.shape

(1000, 9)

#### WordRankUniversity

In [184]:
del WordRankUniversity['index']
WordRankUniversity.head()

,World Rank,Institution,Location,Year,National Rank,Education Rank,Employability Rank,Faculty Rank,Research Rank,Score
0,1,Harvard University,USA,2024,1.0,1.0,1.0,1.0,1.0,100.0
1,2,Massachusetts Institute of Technology,USA,2024,2.0,4.0,12.0,2.0,12.0,96.8
2,3,Stanford University,USA,2024,3.0,10.0,4.0,3.0,2.0,95.2
3,4,University of Cambridge,United Kingdom,2024,1.0,3.0,26.0,4.0,14.0,94.1
4,5,University of Oxford,United Kingdom,2024,2.0,7.0,28.0,9.0,6.0,93.3

In [185]:
WordRankUniversity.shape

(1000, 10)

In [186]:
WordRankUniversity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   World Rank          1000 non-null   int64
 1   Institution         1000 non-null   object
 2   Location            1000 non-null   object
 3   Year                1000 non-null   int64
 4   National Rank       1000 non-null   float64
 5   Education Rank      1000 non-null   float64
 6   Employability Rank  1000 non-null   float64
 7   Faculty Rank        1000 non-null   float64
 8   Research Rank       1000 non-null   float64
 9   Score               1000 non-null   float64
dtypes: float64(6), int64(2), object(2)
memory usage: 78.3+ KB

#### We have 2000 Record and 9 columns:
- World Rank : This represents the overall rank of the university globally.
- University Names: The name of the university.
- Location: The country where the university is located.
- Educational Rank : A specific ranking based on the quality of education.
- Employability Rank: Measures how well the university prepares its graduates for employment. (مقياس مدى قابلية توظيف الخريجين)
- Faculty Rank: Reflects the quality and qualifications of the university's faculty members.(تصنيف مستوى واداء هيئة التدريس)
- Research Rank: Indicates the university’s performance in research activities.
- National Rank: The university's rank within its own country.
- Score: The overall score representing the university's performance across various criteria.

## 1. Data Profiling:
Data profiling is a comprehensive process of examining the data available in an existing dataset and collecting statistics and information about that data.

#### 1-TimesHigher DataSet

In [187]:
TimesHigher.head(3)

,rank,name,scores_overall,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,...,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,closed,unaccredited,disabled,website_url
0,1,University of Oxford,98.5,10,96.6,5,100.0,2,99.0,5,...,"21,750",10.9,42%,49 : 51,University of Oxford,"Geography,Chemistry,Chemical Engineering,Biolo...",False,False,False,https://www.timeshighereducation.com/student/r...
1,2,Stanford University,98.0,20,99.0,1,97.8,8,99.6,2,...,"14,517",6.4,23%,47 : 53,Stanford University,"Computer Science,Communication & Media Studies...",False,False,False,NaN
2,3,Massachusetts Institute of Technology,97.9,30,98.6,2,96.2,11,99.7,1,...,"11,085",8.0,33%,41 : 59,Massachusetts Institute of Technology,"Architecture,Economics & Econometrics,Archaeol...",False,False,False,https://www.timeshighereducation.com/student/r...

In [188]:
TimesHigher.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2673 entries, 0 to 2672
Data columns (total 29 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   rank                               2673 non-null   object
 1   name                               2673 non-null   object
 2   scores_overall                     1904 non-null   object
 3   scores_overall_rank                2673 non-null   int64
 4   scores_teaching                    1904 non-null   float64
 5   scores_teaching_rank               2673 non-null   int64
 6   scores_research                    1904 non-null   float64
 7   scores_research_rank               2673 non-null   int64
 8   scores_citations                   1904 non-null   float64
 9   scores_citations_rank              2673 non-null   int64
 10  scores_industry_income             1904 non-null   float64
 11  scores_industry_income_rank        2673 non-null   int64
 12  scores_international_outlook       1904 non-null   float64
 13  scores_international_outlook_rank  2673 non-null   int64
 14  record_type                        2673 non-null   object
 15  member_level                       2673 non-null   int64
 16  url                                2673 non-null   object
 17  nid                                2673 non-null   int64
 18  location                           2673 non-null   object
 19  stats_number_students              2673 non-null   object
 20  stats_student_staff_ratio          2673 non-null   float64
 21  stats_pc_intl_students             2673 non-null   object
 22  stats_female_male_ratio            2580 non-null   object
 23  aliases                            2673 non-null   object
 24  subjects_offered                   2669 non-null   object
 25  closed                             2673 non-null   bool
 26  unaccredited                       2673 non-null   bool
 27  disabled                           2673 non-null   bool
 28  website_url                        344 non-null    object
dtypes: bool(3), float64(6), int64(8), object(12)
memory usage: 550.9+ KB

In [189]:
TimesHigher.describe(include='object')

,rank,name,scores_overall,record_type,url,location,stats_number_students,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,website_url
count,2673,2673,1904,2673,2673,2673,2673,2673,2580,2673,2669,344
unique,160,2673,159,3,2673,127,2574,85,91,2673,2567,344
top,Reporter,University of Oxford,9.7–22.7,master_account,/world-university-rankings/university-oxford,United States,"1,992",0%,55 : 45,University of Oxford,"Medicine & Dentistry,Other Health",https://www.timeshighereducation.com/student/r...
freq,769,1,395,2509,1,175,3,484,120,1,32,1

In [190]:
TimesHigher.describe(include='number')

,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,scores_industry_income,scores_industry_income_rank,scores_international_outlook,scores_international_outlook_rank,member_level,nid,stats_student_staff_ratio
count,2.673000e+03,1904.000000,2673.000000,1904.000000,2673.000000,1904.000000,2673.000000,1904.000000,2673.000000,1904.000000,2673.000000,2673.000000,2673.000000,2673.000000
mean,2.945872e+05,29.060662,678.473625,23.416176,678.473625,52.189706,678.473625,47.057405,678.473625,49.907143,678.473625,0.550318,437757.592593,19.130527
std,4.486570e+05,13.967201,633.450078,16.697923,633.450078,25.071342,633.450078,26.150454,633.450078,21.828249,633.450078,2.231166,292321.295190,13.450010
min,1.000000e+01,9.400000,0.000000,4.600000,0.000000,3.400000,0.000000,15.600000,0.000000,16.100000,0.000000,0.000000,466.000000,0.300000
25%,6.690000e+03,19.400000,0.000000,11.800000,0.000000,30.400000,0.000000,22.275000,0.000000,31.975000,0.000000,0.000000,131435.000000,12.300000
50%,1.337000e+04,25.800000,568.000000,17.250000,568.000000,52.400000,568.000000,41.050000,568.000000,45.300000,568.000000,0.000000,622251.000000,16.600000
75%,1.000101e+06,34.500000,1236.000000,29.900000,1236.000000,73.225000,1236.000000,68.200000,1236.000000,65.400000,1236.000000,0.000000,675423.000000,22.500000
max,1.000769e+06,99.000000,1904.000000,100.000000,1904.000000,99.700000,1904.000000,100.000000,1904.000000,98.800000,1904.000000,11.000000,726248.000000,333.300000

#### 2-shanghaiRanking Dataset

In [191]:
shanghaiRanking.head(3)

,Rank,University_Name,National/Regional Rank,Alumni,Award,Hici,N&S,PUB,PCP
0,1,Harvard University,1,100.0,97.1,100.0,100.0,100.0,85.7
1,2,Stanford University,2,45.3,88.1,73.1,83.9,73.1,59.6
2,3,Massachusetts Institute of Technology (MIT),3,71.9,82.8,55.2,70.8,59.1,73.6

In [192]:
shanghaiRanking.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    1000 non-null   object
 1   University_Name         1000 non-null   object
 2   National/Regional Rank  1000 non-null   object
 3   Alumni                  1000 non-null   float64
 4   Award                   1000 non-null   float64
 5   Hici                    1000 non-null   float64
 6   N&S                     989 non-null    float64
 7   PUB                     1000 non-null   float64
 8   PCP                     1000 non-null   float64
dtypes: float64(6), object(3)
memory usage: 70.4+ KB

In [193]:
shanghaiRanking.describe(include='object')

            Rank     University_Name National/Regional Rank
count       1000                1000                   1000
unique        87                1000                    130
top     901-1000  Harvard University                      1
freq         100                   1                     60

In [194]:
shanghaiRanking.describe(include='number')

,Alumni,Award,Hici,N&S,PUB,PCP
count,1000.000000,1000.00000,1000.000000,989.000000,1000.000000,1000.000000
mean,4.509600,3.78120,10.734400,10.575126,35.113000,19.655300
std,10.103201,11.45538,10.949265,10.637247,13.684495,8.800436
min,0.000000,0.00000,0.000000,0.000000,9.300000,8.600000
25%,0.000000,0.00000,0.000000,3.900000,25.775000,14.100000
50%,0.000000,0.00000,9.200000,7.300000,31.700000,17.600000
75%,0.000000,0.00000,14.600000,13.300000,41.425000,23.000000
max,100.000000,100.00000,100.000000,100.000000,100.000000,100.000000

#### 3-WordRankUniversity dataset

In [195]:
WordRankUniversity.head(3)

,World Rank,Institution,Location,Year,National Rank,Education Rank,Employability Rank,Faculty Rank,Research Rank,Score
0,1,Harvard University,USA,2024,1.0,1.0,1.0,1.0,1.0,100.0
1,2,Massachusetts Institute of Technology,USA,2024,2.0,4.0,12.0,2.0,12.0,96.8
2,3,Stanford University,USA,2024,3.0,10.0,4.0,3.0,2.0,95.2

In [196]:
WordRankUniversity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   World Rank          1000 non-null   int64
 1   Institution         1000 non-null   object
 2   Location            1000 non-null   object
 3   Year                1000 non-null   int64
 4   National Rank       1000 non-null   float64
 5   Education Rank      1000 non-null   float64
 6   Employability Rank  1000 non-null   float64
 7   Faculty Rank        1000 non-null   float64
 8   Research Rank       1000 non-null   float64
 9   Score               1000 non-null   float64
dtypes: float64(6), int64(2), object(2)
memory usage: 78.3+ KB

In [197]:
WordRankUniversity.describe(include='object')

               Institution Location
count                 1000     1000
unique                1000       63
top     Harvard University      USA
freq                     1      209

In [198]:
WordRankUniversity.describe(include='number')

,World Rank,Year,National Rank,Education Rank,Employability Rank,Faculty Rank,Research Rank,Score
count,1000.000000,1000.0,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,500.500000,2024.0,44.586000,447.949000,724.501000,245.608000,501.440000,75.601500
std,288.819436,0.0,52.659602,168.804287,349.520836,77.059357,290.392862,4.536597
min,1.000000,2024.0,1.000000,1.000000,1.000000,1.000000,1.000000,70.500000
25%,250.750000,2024.0,6.000000,385.750000,430.750000,277.250000,250.750000,72.200000
50%,500.500000,2024.0,22.000000,551.000000,1001.000000,284.000000,500.500000,74.350000
75%,750.250000,2024.0,61.250000,551.000000,1001.000000,284.000000,750.250000,77.800000
max,1000.000000,2024.0,209.000000,551.000000,1001.000000,284.000000,1001.000000,100.000000

The process of profiling differs slightly for categorical and numerical variables due to their inherent differences.

**The two main types of data are:**
- Quantitative (numerical) data
- Qualitative (categorical) data

### Data Quality Checks
Data quality checks involve the process of ensuring that the data is accurate, complete, consistent, relevant, and reliable. 


**Here are typical steps involved in checking data quality:**

#### 1. Reliability:
Evaluate the data's source and collection process to determine its trustworthiness.

#### 2. Timeliness: 
Ensure the data is up-to-date and reflective of the current situation or the period of interest for the analysis.

#### 3. Consistency: 

Confirm that the data is consistent within the dataset and across multiple data sources. For example, the same data point should not have different values in different places.

#### 4. Relevance: 
Assess whether the data is appropriate and applicable for the intended analysis. Data that is not relevant can skew results and lead to incorrect conclusions.

**Key considerations for relevance include:**

> 1. Sample Appropriateness: Confirm that your data sample aligns with your analysis objectives. For instance, utilizing data from the Northern region will not yield accurate insights for the Western region of the Kingdom.
>
> 2. Variable Selection: Any column will not be relevant for our analysis, we can get rid of these using the drop() method. We will set the “axis” argument to 1 since we’re dealing with columns, and set the “inplace” argument to True to make the change permanent.

In [199]:
# We will delete

#### 5. Uniqueness: 
Check for and remove duplicate records to prevent skewed analysis results.

#### shanghaiRanking

In [200]:
shanghaiRanking.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Rank                    1000 non-null   object
 1   University_Name         1000 non-null   object
 2   National/Regional Rank  1000 non-null   object
 3   Alumni                  1000 non-null   float64
 4   Award                   1000 non-null   float64
 5   Hici                    1000 non-null   float64
 6   N&S                     989 non-null    float64
 7   PUB                     1000 non-null   float64
 8   PCP                     1000 non-null   float64
dtypes: float64(6), object(3)
memory usage: 70.4+ KB

In [201]:
# Check if there is a duplicated rows 
shanghaiRanking.duplicated().sum()

0

In [202]:
shanghaiRanking['University_Name'].duplicated().sum()

0

In [203]:
shanghaiRanking['Rank'].duplicated().sum()

913

In [204]:
# View all duplicated values and number of duplicates
shanghaiRanking[shanghaiRanking['Rank'].duplicated(keep=False)]['Rank'].value_counts()

Rank
901-1000    100
801-900     100
701-800     100
601-700     100
501-600     100
401-500     100
301-400     100
201-300     100
151-200      50
101-150      50
90            4
82            3
69            3
55            3
47            3
74            2
12            2
86            2
72            2
95            2
58            2
50            2
45            2
43            2
33            2
18            2
8             2
Name: count, dtype: int64

In [205]:
count_result = (shanghaiRanking == '-').sum()
count_result

Rank                      0
University_Name           0
National/Regional Rank    0
Alumni                    0
Award                     0
Hici                      0
N&S                       0
PUB                       0
PCP                       0
dtype: int64

#### WordRankUniversity

In [206]:
WordRankUniversity.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   World Rank          1000 non-null   int64
 1   Institution         1000 non-null   object
 2   Location            1000 non-null   object
 3   Year                1000 non-null   int64
 4   National Rank       1000 non-null   float64
 5   Education Rank      1000 non-null   float64
 6   Employability Rank  1000 non-null   float64
 7   Faculty Rank        1000 non-null   float64
 8   Research Rank       1000 non-null   float64
 9   Score               1000 non-null   float64
dtypes: float64(6), int64(2), object(2)
memory usage: 78.3+ KB

In [207]:
# Check if there is a duplicated rows 
WordRankUniversity.duplicated().sum()

0

In [208]:
# Check if there is a duplicated University Names
WordRankUniversity['Institution'].duplicated().sum()

0

In [209]:
# Check if there is a duplicated Ranking 
WordRankUniversity['World Rank'].duplicated().sum()

0

In [210]:
# Check if there is a duplicated Ranking National using Location and National Rank
WordRankUniversity[['Location','National Rank']].duplicated().sum()

0

In [211]:
# See what is the duplicated values
WordRankUniversity[WordRankUniversity['Employability Rank'].duplicated(keep=False)]['Employability Rank'].value_counts()

Employability Rank
1001.0    511
Name: count, dtype: int64

In [212]:
WordRankUniversity[WordRankUniversity['Faculty Rank'].duplicated(keep=False)]['Employability Rank'].value_counts()

Employability Rank
1001.0    442
18.0        1
443.0       1
494.0       1
150.0       1
         ...
505.0       1
374.0       1
230.0       1
919.0       1
923.0       1
Name: count, Length: 319, dtype: int64

In [213]:
WordRankUniversity[WordRankUniversity['Education Rank'].duplicated(keep=False)]['Employability Rank'].value_counts()

Employability Rank
1001.0    413
806.0       1
652.0       1
82.0        1
155.0       1
         ...
696.0       1
938.0       1
578.0       1
609.0       1
30.0        1
Name: count, Length: 221, dtype: int64

In [214]:
# View the count if - value is found in any column 
count_result = (WordRankUniversity == '-').sum()
count_result

World Rank            0
Institution           0
Location              0
Year                  0
National Rank         0
Education Rank        0
Employability Rank    0
Faculty Rank          0
Research Rank         0
Score                 0
dtype: int64

In [215]:

WordRankUniversity['Research Rank'].duplicated(keep=False).sum()

40

In [216]:
WordRankUniversity['Faculty Rank'].duplicated(keep=False).sum()

760

#### TimesHigher

In [217]:
TimesHigher.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2673 entries, 0 to 2672
Data columns (total 29 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   rank                               2673 non-null   object
 1   name                               2673 non-null   object
 2   scores_overall                     1904 non-null   object
 3   scores_overall_rank                2673 non-null   int64
 4   scores_teaching                    1904 non-null   float64
 5   scores_teaching_rank               2673 non-null   int64
 6   scores_research                    1904 non-null   float64
 7   scores_research_rank               2673 non-null   int64
 8   scores_citations                   1904 non-null   float64
 9   scores_citations_rank              2673 non-null   int64
 10  scores_industry_income             1904 non-null   float64
 11  scores_industry_income_rank        2673 non-null   int64
 12  scores_international_outlook       1904 non-null   float64
 13  scores_international_outlook_rank  2673 non-null   int64
 14  record_type                        2673 non-null   object
 15  member_level                       2673 non-null   int64
 16  url                                2673 non-null   object
 17  nid                                2673 non-null   int64
 18  location                           2673 non-null   object
 19  stats_number_students              2673 non-null   object
 20  stats_student_staff_ratio          2673 non-null   float64
 21  stats_pc_intl_students             2673 non-null   object
 22  stats_female_male_ratio            2580 non-null   object
 23  aliases                            2673 non-null   object
 24  subjects_offered                   2669 non-null   object
 25  closed                             2673 non-null   bool
 26  unaccredited                       2673 non-null   bool
 27  disabled                           2673 non-null   bool
 28  website_url                        344 non-null    object
dtypes: bool(3), float64(6), int64(8), object(12)
memory usage: 550.9+ KB

In [218]:
# Check if there is a duplicated rows 
TimesHigher.duplicated().sum()

0

In [219]:
# Check if there is a duplicated University Name
TimesHigher['name'].duplicated().sum()

0

In [220]:
# Check if there is a duplicated Rank 
TimesHigher['rank'].duplicated().sum()

2513

In [221]:
TimesHigher[TimesHigher['rank'].duplicated(keep=False)]['rank'].value_counts()

rank
Reporter     769
1501+        395
1201–1500    307
1001–1200    201
601–800      199
801–1000     198
501–600      102
401–500      102
251–300       52
351–400       50
201–250       49
301–350       48
=168           6
=193           5
=140           3
=199           3
=177           3
=161           3
=152           3
=155           3
=64            3
=87            3
=106           3
=111           3
=143           2
=145           2
=55            2
=92            2
=95            2
=97            2
=99            2
=103           2
=109           2
=116           2
=119           2
=191           2
=187           2
=185           2
=123           2
=175           2
=130           2
=164           2
=136           2
=158           2
=38            2
=138           2
=150           2
=30            2
Name: count, dtype: int64

In [222]:
TimesHigher[TimesHigher['rank'] == 'Reporter'].head(10)

,rank,name,scores_overall,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,...,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,closed,unaccredited,disabled,website_url
1904,Reporter,Abbes Laghrour University of Khenchala,NaN,1000001,NaN,0,NaN,0,NaN,0,...,"18,085",26.1,0%,70 : 30,Abbes Laghrour University of Khenchala,"Languages, Literature & Linguistics,Chemical E...",False,False,False,NaN
1905,Reporter,Abbottabad University of Science and Technology,NaN,1000002,NaN,0,NaN,0,NaN,0,...,"4,200",13.3,0%,31 : 69,Abbottabad University of Science and Technology,"Computer Science,Business & Management,Mathema...",False,False,False,NaN
1906,Reporter,Abdelhafid Boussouf University Center of Mila,NaN,1000003,NaN,0,NaN,0,NaN,0,...,"11,027",24.9,0%,72 : 28,Abdelhafid Boussouf University Center of Mila,"Geology, Environmental, Earth & Marine Science...",False,False,False,NaN
1907,Reporter,Abdullah Gül University,NaN,1000004,NaN,0,NaN,0,NaN,0,...,"2,944",22.5,9%,46 : 54,Abdullah Gül University,"Biological Sciences,Physics & Astronomy,Politi...",False,False,False,NaN
1908,Reporter,Abertay University,NaN,1000005,NaN,0,NaN,0,NaN,0,...,"4,205",23.4,21%,47 : 53,Abertay University,"Other Health,Business & Management,Art, Perfor...",False,False,False,https://www.timeshighereducation.com/student/r...
1909,Reporter,Abia State University,NaN,1000006,NaN,0,NaN,0,NaN,0,...,"21,502",45.8,0%,49 : 51,Abia State University,"Languages, Literature & Linguistics,Mathematic...",False,False,False,NaN
1910,Reporter,Abrar University,NaN,1000007,NaN,0,NaN,0,NaN,0,...,495,5.5,0%,40 : 60,Abrar University,"Agriculture & Forestry,Veterinary Science,Comp...",False,False,False,NaN
1911,Reporter,Ada Kent University,NaN,1000008,NaN,0,NaN,0,NaN,0,...,911,1.0,19%,39 : 61,Ada Kent University,"Other Health,Education,Languages, Literature &...",False,False,False,NaN
1912,Reporter,Adventist University of Central Africa,NaN,1000009,NaN,0,NaN,0,NaN,0,...,"3,174",31.7,11%,44 : 56,Adventist University of Central Africa,"Languages, Literature & Linguistics,Business &...",False,False,False,NaN
1913,Reporter,AECC University College,NaN,1000010,NaN,0,NaN,0,NaN,0,...,780,19.5,39%,45 : 55,AECC University College,"Sport Science,Psychology,Other Health",False,False,False,NaN

In [223]:
TimesHigher.sort_values('scores_overall').head(2)

,rank,name,scores_overall,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,...,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,closed,unaccredited,disabled,website_url
1207,1201–1500,Allameh Tabataba ’i University,22.8–28.2,12080,29.1,738,14.2,1184,28.5,1482,...,"15,113",29.7,3%,57 : 43,Allameh Tabataba ’i University,"Mathematics & Statistics,Law,Business & Manage...",False,False,False,NaN
1299,1201–1500,University of Hormozgan,22.8–28.2,13000,24.6,1035,14.1,1192,37.6,1265,...,"5,338",24.4,0%,58 : 42,University of Hormozgan,"Agriculture & Forestry,Psychology,Sport Scienc...",False,False,False,NaN

In [224]:
# View the count if - value is found in any column 
count_result2 = (TimesHigher == '-').sum()
count_result2

rank                                 0
name                                 0
scores_overall                       0
scores_overall_rank                  0
scores_teaching                      0
scores_teaching_rank                 0
scores_research                      0
scores_research_rank                 0
scores_citations                     0
scores_citations_rank                0
scores_industry_income               0
scores_industry_income_rank          0
scores_international_outlook         0
scores_international_outlook_rank    0
record_type                          0
member_level                         0
url                                  0
nid                                  0
location                             0
stats_number_students                0
stats_student_staff_ratio            0
stats_pc_intl_students               0
stats_female_male_ratio              0
aliases                              0
subjects_offered                     0
closed                               0
unaccredited                         0
disabled                             0
website_url                          0
dtype: int64

In [225]:
# There is a duplicated 
TimesHigher[TimesHigher['scores_overall'].duplicated(keep=False)]['scores_overall'].describe(include='object')

count         1792
unique          47
top       9.7–22.7
freq           395
Name: scores_overall, dtype: object

In [226]:
TimesHigher['nid'].duplicated().sum()

0

In [227]:
# go to delete duplicates columns

#### 6. Completeness: 
Ensure that no critical data is missing. This might mean checking for null values or required fields that are empty.

We will start by checking the dataset for missing or null values. For this, we can use the isna() method which returns a dataframe of boolean values indicating if a field is null or not. To group all missing values by column, we can include the sum() method.

In [228]:
#Display number missing values per column

#### shanghaiRanking

In [229]:
shanghaiRanking.isnull().sum().sort_values(ascending = False)

N&S                       11
Rank                       0
University_Name            0
National/Regional Rank     0
Alumni                     0
Award                      0
Hici                       0
PUB                        0
PCP                        0
dtype: int64

#### WordRankUniversity

In [230]:
WordRankUniversity.isnull().sum().sort_values(ascending = False)

World Rank            0
Institution           0
Location              0
Year                  0
National Rank         0
Education Rank        0
Employability Rank    0
Faculty Rank          0
Research Rank         0
Score                 0
dtype: int64

#### TimesHigher

In [231]:
TimesHigher.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2673 entries, 0 to 2672
Data columns (total 29 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   rank                               2673 non-null   object
 1   name                               2673 non-null   object
 2   scores_overall                     1904 non-null   object
 3   scores_overall_rank                2673 non-null   int64
 4   scores_teaching                    1904 non-null   float64
 5   scores_teaching_rank               2673 non-null   int64
 6   scores_research                    1904 non-null   float64
 7   scores_research_rank               2673 non-null   int64
 8   scores_citations                   1904 non-null   float64
 9   scores_citations_rank              2673 non-null   int64
 10  scores_industry_income             1904 non-null   float64
 11  scores_industry_income_rank        2673 non-null   int64
 12  scores_international_outlook       1904 non-null   float64
 13  scores_international_outlook_rank  2673 non-null   int64
 14  record_type                        2673 non-null   object
 15  member_level                       2673 non-null   int64
 16  url                                2673 non-null   object
 17  nid                                2673 non-null   int64
 18  location                           2673 non-null   object
 19  stats_number_students              2673 non-null   object
 20  stats_student_staff_ratio          2673 non-null   float64
 21  stats_pc_intl_students             2673 non-null   object
 22  stats_female_male_ratio            2580 non-null   object
 23  aliases                            2673 non-null   object
 24  subjects_offered                   2669 non-null   object
 25  closed                             2673 non-null   bool
 26  unaccredited                       2673 non-null   bool
 27  disabled                           2673 non-null   bool
 28  website_url                        344 non-null    object
dtypes: bool(3), float64(6), int64(8), object(12)
memory usage: 550.9+ KB

In [ ]:
TimesHigher.isnull().sum().sort_values(ascending = False)

(2673, 30)

In [233]:

TimesHigher.fillna({'sdg-score-multi__number 7': '0'}, inplace=True)
TimesHigher.fillna({'sdg-score-multi__number 8': '0'}, inplace=True)
TimesHigher.fillna({'sdg-score-multi__number 6': '0'}, inplace=True)
TimesHigher.fillna({'sdg-score-multi__number 5': '0'}, inplace=True)
TimesHigher.fillna({'sdg-score-multi__number 3': '0'}, inplace=True)
TimesHigher.fillna({'sdg-score-multi__number 2': '0'}, inplace=True)
TimesHigher.fillna({'sdg-score-multi__number': '0'}, inplace=True)

In [277]:
TimesHigher.fillna({'scores_research': '0'}, inplace=True)
TimesHigher.fillna({'scores_international_outlook': 0.}, inplace=True)
TimesHigher.fillna({'scores_industry_income 6': 0.}, inplace=True)
TimesHigher.fillna({'scores_citations': 0.}, inplace=True)
TimesHigher.fillna({'scores_teaching': 0.}, inplace=True)
TimesHigher.fillna({'scores_overall': 0.}, inplace=True)
TimesHigher.fillna({'scores_industry_income': 0.}, inplace=True)

In [235]:
TimesHigher.fillna({'Location': 'Unknown'}, inplace=True)
TimesHigher.fillna({'ranking-institution-title href': 'Unknown'}, inplace=True)

In [278]:
TimesHigher.isnull().sum().sort_values(ascending = False)

website_url                          2329
stats_female_male_ratio                93
subjects_offered                        4
rank                                    0
name                                    0
disabled                                0
unaccredited                            0
closed                                  0
aliases                                 0
stats_pc_intl_students                  0
stats_student_staff_ratio               0
stats_number_students                   0
location                                0
nid                                     0
url                                     0
member_level                            0
record_type                             0
scores_international_outlook_rank       0
scores_international_outlook            0
scores_industry_income_rank             0
scores_industry_income                  0
scores_citations_rank                   0
scores_citations                        0
scores_research_rank                    0
scores_research                         0
scores_teaching_rank                    0
scores_teaching                         0
scores_overall_rank                     0
scores_overall                          0
rank_end_range                          0
dtype: int64

In [237]:
# go to clean them

In [238]:
# go to clean them

#### 7. Check Accuracy:

Verify that the data is correct and precise. This could involve comparing data samples with known sources or using validation rules.

**The process includes:**
1. Validating the appropriateness of data types for the dataset.
2. Identifying outliers  using established validation  rule

In [239]:
# check columns types

In [240]:
WordRankUniversity.head()
df = WordRankUniversity.astype({'Employability Rank':int})
df2 = df[df['Employability Rank'] > 0 ]
df2.sort_values('Employability Rank').head(10)

,World Rank,Institution,Location,Year,National Rank,Education Rank,Employability Rank,Faculty Rank,Research Rank,Score
0,1,Harvard University,USA,2024,1.0,1.0,1,1.0,1.0,100.0
121,122,INSEAD,France,2024,6.0,551.0,2,284.0,1001.0,81.0
208,209,Institut national du service public,France,2024,11.0,551.0,3,284.0,1001.0,78.6
2,3,Stanford University,USA,2024,3.0,10.0,4,3.0,2.0,95.2
271,272,China Europe International Business School,China,2024,34.0,551.0,5,284.0,1001.0,77.4
12,13,University of Tokyo,Japan,2024,1.0,39.0,6,116.0,32.0,89.8
272,273,HEC Paris,France,2024,15.0,551.0,7,284.0,1001.0,77.4
7,8,University of Pennsylvania,USA,2024,6.0,14.0,8,43.0,13.0,91.6
44,45,Institut Polytechnique de Paris,France,2024,5.0,99.0,9,187.0,403.0,85.2
404,405,International Institute for Management Develop...,Switzerland,2024,8.0,551.0,10,284.0,1001.0,75.4

In [241]:
WordRankUniversity.head(10)

,World Rank,Institution,Location,Year,National Rank,Education Rank,Employability Rank,Faculty Rank,Research Rank,Score
0,1,Harvard University,USA,2024,1.0,1.0,1.0,1.0,1.0,100.0
1,2,Massachusetts Institute of Technology,USA,2024,2.0,4.0,12.0,2.0,12.0,96.8
2,3,Stanford University,USA,2024,3.0,10.0,4.0,3.0,2.0,95.2
3,4,University of Cambridge,United Kingdom,2024,1.0,3.0,26.0,4.0,14.0,94.1
4,5,University of Oxford,United Kingdom,2024,2.0,7.0,28.0,9.0,6.0,93.3
5,6,Princeton University,USA,2024,4.0,5.0,15.0,7.0,83.0,92.6
6,7,Columbia University,USA,2024,5.0,12.0,14.0,10.0,15.0,92.1
7,8,University of Pennsylvania,USA,2024,6.0,14.0,8.0,43.0,13.0,91.6
8,9,Yale University,USA,2024,7.0,6.0,33.0,13.0,21.0,91.2
9,10,California Institute of Technology,USA,2024,8.0,2.0,100.0,6.0,89.0,90.8

In [279]:
TimesHigher.head(10)

,rank,name,scores_overall,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,...,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,closed,unaccredited,disabled,website_url,rank_end_range
0,1,University of Oxford,98.5,10,96.6,5,100.0,2,99.0,5,...,10.9,42%,49 : 51,University of Oxford,"Geography,Chemistry,Chemical Engineering,Biolo...",False,False,False,https://www.timeshighereducation.com/student/r...,1
1,2,Stanford University,98.0,20,99.0,1,97.8,8,99.6,2,...,6.4,23%,47 : 53,Stanford University,"Computer Science,Communication & Media Studies...",False,False,False,NaN,2
2,3,Massachusetts Institute of Technology,97.9,30,98.6,2,96.2,11,99.7,1,...,8.0,33%,41 : 59,Massachusetts Institute of Technology,"Architecture,Economics & Econometrics,Archaeol...",False,False,False,https://www.timeshighereducation.com/student/r...,3
3,4,Harvard University,97.8,40,97.7,3,99.9,3,99.4,3,...,9.0,25%,51 : 49,Harvard University,"Sociology,Architecture,Physics & Astronomy,Psy...",False,False,False,https://www.timeshighereducation.com/student/r...,4
4,5,University of Cambridge,97.5,50,95.8,7,100.0,1,98.0,12,...,11.5,38%,48 : 52,University of Cambridge,Politics & International Studies (incl Develop...,False,False,False,https://www.timeshighereducation.com/student/r...,5
5,6,Princeton University,96.9,60,96.3,6,97.9,7,98.8,7,...,7.3,23%,47 : 53,Princeton University,"History, Philosophy & Theology,Agriculture & F...",False,False,False,https://www.timeshighereducation.com/student/r...,6
6,7,California Institute of Technology,96.5,70,96.6,4,98.0,6,95.9,38,...,6.1,33%,37 : 63,California Institute of Technology caltech,"Computer Science,Chemistry,Chemical Engineerin...",False,False,False,https://www.timeshighereducation.com/student/r...,7
7,8,Imperial College London,95.1,80,90.9,12,95.5,12,98.6,8,...,11.8,61%,42 : 58,Imperial College London,"Computer Science,Mechanical & Aerospace Engine...",False,False,False,https://www.timeshighereducation.com/student/r...,8
8,9,"University of California, Berkeley",94.6,90,87.2,18,98.8,4,99.0,4,...,17.9,22%,52 : 48,"University of California, Berkeley","Chemistry,Electrical & Electronic Engineering,...",False,False,False,https://www.timeshighereducation.com/student/r...,9
9,10,Yale University,94.2,100,94.0,10,94.9,13,97.7,18,...,5.2,21%,51 : 49,Yale University,"Law,Computer Science,Electrical & Electronic E...",False,False,False,https://www.timeshighereducation.com/student/r...,10

In [243]:
shanghaiRanking.head(10)

,Rank,University_Name,National/Regional Rank,Alumni,Award,Hici,N&S,PUB,PCP
0,1,Harvard University,1,100.0,97.1,100.0,100.0,100.0,85.7
1,2,Stanford University,2,45.3,88.1,73.1,83.9,73.1,59.6
2,3,Massachusetts Institute of Technology (MIT),3,71.9,82.8,55.2,70.8,59.1,73.6
3,4,University of Cambridge,1,78.2,90.8,45.1,59.8,67.2,60.6
4,5,"University of California, Berkeley",4,65.3,76.5,46.9,62.8,57.1,55.5
5,6,University of Oxford,2,49.5,59.7,51.3,57.2,77.1,47.9
6,7,Princeton University,5,61.2,100.0,26.0,51.3,42.3,75.3
7,8,California Institute of Technology,6-7,55.7,63.4,29.8,57.9,41.0,100.0
8,8,Columbia University,6-7,59.4,63.2,42.7,51.9,67.0,31.6
9,10,University of Chicago,8,59.0,84.5,32.5,44.9,53.0,44.2

In [274]:
#url column have more null values so we decide  to delete the column

In [245]:
word_top10 = WordRankUniversity[['University Names','Score']].head(10)
times_higher_top10 = TimesHigher[['University Name ','scores']].head(10)
shanghai_top10 = shanghaiRanking[['University Name','Total Score']].head(10)

word_top10 = word_top10.rename(columns={"University Names": "University", "Score": "Word Rank Score"})
times_higher_top10 = times_higher_top10.rename(columns={"University Name ": "University", "scores": "Times Higher Score"})
shanghai_top10 = shanghai_top10.rename(columns={"University Name": "University", "Total Score": "Shanghai Score"})

merged_df = word_top10.merge(times_higher_top10, on="University", how="outer").merge(shanghai_top10, on="University", how="outer")

merged_df.fillna(merged_df.median(numeric_only=True), inplace=True)

merged_df["Avg Score"] = merged_df[['Word Rank Score', 'Times Higher Score', 'Shanghai Score']].mean(axis=1)

top_10_global = merged_df.sort_values(by="Avg Score", ascending=False).head(10)
top_10_global

KeyError: "['University Names'] not in index"

In [246]:
# go to clean them

In [247]:
# check outliers

**What is an Outlier?** 
Outlier is an row/observation that appears far away and diverges from an overall pattern in a sample.

**What are the types of Outliers?**
1. Univariate: These outliers can be found when we look at distribution of a single variable
2. Multivariate: are outliers in an n-dimensional space. In order to find them, you have to look at distributions in multi-dimensions. example (hight=100, weight=100) for a person

**What causes Outliers?**
Whenever we come across outliers, the ideal way to tackle them is to find out the reason of having these outliers. The method to deal with them would then depend on the reason of their occurrence.

Let’s understand various types of outliers:

1. Data Entry Errors:- Human errors such as errors caused during data collection, recording, or entry can cause outliers in data.
2. Measurement Error: It is the most common source of outliers. This is caused when the measurement instrument used turns out to be faulty.
3. Data Processing Error: Whenever we perform data mining, we extract data from multiple sources. It is possible that some manipulation or extraction errors may lead to outliers in the dataset.
4. Sampling error: For instance, we have to measure the height of athletes. By mistake, we include a few basketball players in the sample. This inclusion is likely to cause outliers in the dataset.
5. Natural Outlier: When an outlier is not artificial (due to error), it is a natural outlier. For instance: In my last assignment with one of the renowned insurance company, I noticed that the performance of top 50 financial advisors was far higher than rest of the population. Surprisingly, it was not due to any error. Hence, whenever we perform any data mining activity with advisors, we used to treat this segment separately.


**What is the impact of Outliers on a dataset?**


![image.png](https://www.analyticsvidhya.com/wp-content/uploads/2015/02/Outlier_31.png)



**How to detect Outliers?**

1. Most commonly used method to detect outliers is visualization (Univariate Graphical Analysis).

We use 3 common visualization methods:
>- Box-plot: A box plot is a method for graphically depicting groups of numerical data through their quartiles. The box extends from the Q1 to Q3 quartile values of the data, with a line at the median (Q2). The whiskers extend from the edges of the box to show the range of the data. Outlier points are those past the end of the whiskers. Box plots show robust measures of location and spread as well as providing information about symmetry and outliers.
>
>  
>![image.png](https://miro.medium.com/v2/resize:fit:698/format:webp/1*VK5iHA2AB28HSZwWwUbNYg.png)
>
>
>- Histogram
>- Scatter Plot: A scatter plot is a mathematical diagram using Cartesian coordinates to display values for two variables for a set of data. The data are displayed as a collection of points, each having the value of one variable determining the position on the horizontal axis and the value of the other variable determining the position on the vertical axis. The points that are far from the population can be termed as an outlier.
>
>  
>![image.png](https://miro.medium.com/v2/resize:fit:4800/format:webp/1*Ov6aH-8yIwNoUxtMFwgx4g.png)
>
>

2. Using statistical method (Univariate Non-Graphical analysis):
>- Any value, which is beyond the range of -1.5 x IQR to 1.5 x IQR
 
![image.png](https://www.whatissixsigma.net/wp-content/uploads/2015/07/Box-Plot-Diagram-to-identify-Outliers-figure-1.png)

>- Use capping methods. Any value which out of range of 5th and 95th percentile can be considered as outlier
>- Data points, three or more standard deviation away from mean are considered outlier: The Z-score is the signed number of standard deviations by which the value of an observation or data point is above the mean value of what is being observed or measured. While calculating the Z-score we re-scale and center the data and look for data points that are too far from zero. These data points which are way too far from zero will be treated as the outliers. In most of the cases, a threshold of 3 or -3 is used i.e if the Z-score value is greater than or less than 3 or -3 respectively, that data point will be identified as outliers.
> - Outlier detection is merely a special case of the examination of data for influential data points and it also depends on the business understanding

In [248]:
# go to univariate graphical analysis
# go to lesson : data visualisation 1 - chart type section
# then go to univariate graphical analysis
# detect outliers using graphs varbaly

In [249]:
# go to lesson: statistics 1 then statistics 3
# then go to univariate Non graphical analysis
# detect outliers using numerical statistics

In [250]:
# go to delete ouliers

## 2. Data Cleaning: 

Preliminary findings from data profiling can lead to cleaning the data by:
- Handling missing values
- Correcting errors.
- Dealing with outliers.

-------------------

### Handling missing values:

**Why my data has missing values?**
They may occur at two stages:
1. Data Extraction: It is possible that there are problems with extraction process. Errors at data extraction stage are typically easy to find and can be corrected easily as well.
2. Data collection: These errors occur at time of data collection and are harder to correct.

**Why do we need to handle the missing data?**
To avoid:
- Bias the conclusions.
- Leading the business to make wrong decisions.

**Which are the methods to treat missing values ?**
1. Deletion: we delete rows where any of the variable is missing. Simplicity is one of the major advantage of this method, but this method reduces the power of model because it reduces the sample size.

2. Imputation: is a method to fill in the missing values with estimated ones. This imputation is one of the most frequently used methods.

    2.1. Mean/ Mode/ Median Imputation: It consists of replacing the missing data for a given attribute by the mean or median (quantitative attribute) or mode (qualitative attribute) of all known values of that variable.
    > It can be of two types:
    > - Generalized Imputation: In this case, we calculate the mean or median for all non missing values of that variable then replace missing value with mean or median.
    > - Similar case Imputation: In this case, we calculate average for each group individually of non missing values then replace the missing value based on the group.

    2.2. Constant Value
   
    2.3. Forward Filling
   
    2.4. Backward Filling

6. Prediction Model:  Prediction model is one of the sophisticated method for handling missing data. Here, we create a predictive model to estimate values that will substitute the missing data.  In this case, we divide our data set into two sets: One set with no missing values for the variable and another one with missing values. First data set become training data set of the model while second data set with missing values is test data set and variable with missing values is treated as target variable. Next, we create a model to predict target variable based on other attributes of the training data set and populate missing values of test data set.

> There are 2 drawbacks for this approach:
> - The model estimated values are usually more well-behaved than the true values
> - If there are no relationships with attributes in the data set and the attribute with missing values, then the model will not be precise for estimating missing values.

9. KNN Imputation: In this method of imputation, the missing values of an attribute are imputed using the given number of attributes that are most similar to the attribute whose values are missing. The similarity of two attributes is determined using a distance function. It is also known to have certain advantage & disadvantages.

   > **Advantages:**
   > - k-nearest neighbour can predict both qualitative & quantitative attributes
   > - Creation of predictive model for each attribute with missing data is not required
   > - Attributes with multiple missing values can be easily treated
   > - Correlation structure of the data is taken into consideration

   > **Disadvantage:**
   > - KNN algorithm is very time-consuming in analyzing large database. It searches through all the dataset looking for the most similar instances.
   > - Choice of k-value is very critical. Higher value of k would include attributes which are significantly different from what we need whereas lower value of k implies missing out of significant attributes.

--------------------

##### TimesHigher

- We will clean Rank column 
    - If is Reporter we will replace it with 0 
    - If is a range we will add new column named rank_end_range
    - If is has = or + we will remove it

In [251]:
TimesHigher.tail(2)

,rank,name,scores_overall,scores_overall_rank,scores_teaching,scores_teaching_rank,scores_research,scores_research_rank,scores_citations,scores_citations_rank,...,stats_number_students,stats_student_staff_ratio,stats_pc_intl_students,stats_female_male_ratio,aliases,subjects_offered,closed,unaccredited,disabled,website_url
2671,Reporter,Ziane Achour University of Djelfa,NaN,1000768,NaN,0,NaN,0,NaN,0,...,"31,103",28.5,0%,55 : 45,Ziane Achour University of Djelfa,"Architecture,Agriculture & Forestry,Biological...",False,False,False,NaN
2672,Reporter,Ziauddin University,NaN,1000769,NaN,0,NaN,0,NaN,0,...,"5,672",9.2,0%,58 : 42,Ziauddin University,"Medicine & Dentistry,Other Health",False,False,False,NaN

In [252]:
# Reporter case
TimesHigher['rank'] = TimesHigher['rank'].map(lambda x : '0–0' if x == 'Reporter' else x )

In [253]:
len(TimesHigher['rank'][9].split('+'))

1

In [254]:
# = Case 
#TimesHigher['rank'] = TimesHigher['rank'].map(lambda x: x.split('=')[1] if len( x.split('='))>0 else x)#.value_counts()
TimesHigher['rank'] = TimesHigher['rank'].map(lambda x: x.split('=')[1] if '=' in x else x)

In [255]:
# + Case 
TimesHigher['rank'] = TimesHigher['rank'].map(lambda x: x.split('+')[0] if '+' in x else x)

- 1500+
- = 55
- 500
- 501-600

In [256]:
TimesHigher['rank'][2000].split('–')

['0', '0']

In [257]:
# We will add new column for range 
def clean_rank(x):
    if x.isdigit():
        return int(x)
    return int(x.split('–')[0].strip())

clean_rank_range = lambda x: int(x.split('–')[1].strip()) if '–' in x else int(x)

In [258]:
TimesHigher['rank_end_range']= TimesHigher['rank'].apply(clean_rank_range)
TimesHigher['rank'] = TimesHigher['rank'].apply(clean_rank)

In [267]:
TimesHigher['rank_end_range'].value_counts().head(10)

rank_end_range
0       769
1501    395
1500    307
1200    201
800     199
1000    198
500     102
600     102
300      52
400      50
Name: count, dtype: int64

In [ ]:
# go back to 6th dimention --> Completeness

### Correcting errors

-------------------

In [ ]:
# go back to 7th dimension Accuracy

### Dealing with outliers:

**How to remove Outliers?**
Most of the ways to deal with outliers are similar to the methods of missing values like deleting rows, transforming them, binning them, treat them as a separate group, imputing values and other statistical methods. Here, we will discuss the common techniques used to deal with outliers:

1. Deleting rows: We delete outlier values if it is due to data entry error, data processing error or outlier rows are very small in numbers. We can also use trimming at both ends to remove outliers.

2. Imputing: Like imputation of missing values, we can also impute outliers. We can use mean, median, mode imputation methods. Before imputing values, we should analyse if it is natural outlier or artificial. If it is artificial, we can go with imputing values. We can also use statistical model to predict values of outlier rows and after that we can impute it with predicted values.

3. Treat separately: If there are significant number of outliers, we should treat them separately in the statistical model. One of the approach is to treat both groups as two different groups and build individual model for both groups and then combine the output.

## 3. Univariate Analysis: 

This involves examining single variables to understand their characteristics (distribution, central tendency, dispersion, and shape).

We calculate **numerical values** about the data that tells us about the distribution of the data. We also **draw graphs** showing visually how the data is distributed. **To answer the following questions about Features/characteristics of Data:**
- Where is the center of the data? (location)
- How much does the data vary? (scale)
- What is the shape of the data? (shape)

**The benefits of this analysis:**
Statistics summary gives a high-level idea to identify whether the data has any outliers, data entry error, distribution of data such as the data is normally distributed or left/right skewed

**In this step, we will explore variables one by one using following approaches:**

### 1. Univariate Graphical Analysis:
Method to perform uni-variate analysis will depend on whether the variable type is categorical or numerical.

#### I. Categorical Variables:

we’ll use frequency table to understand distribution of each category
- Bar Chart (Ordinal) - Orderd
- Pie Chart (Nominal) - non Orderd

#### II. Numerical Variables:

we need to understand the central tendency and spread of the variable (Descriptive Analysis) using:
   - Box plot
   - Histogram

### 2. Univariate Non-Graphical analysis: 

- Where is the center of the data? (location) --> **Measures of central tendency**
- How much does the data vary? (scale) --> **Measure of variability**
- What is the shape of the data? (shape) --> **Measures of variation combined with an average (measure of center) gives a good picture of the distribution of the data.**

## 4. Bivariate/Multivariate Analysis:

Here, you look at the relationships between two or more variables. This can involve looking for correlations, patterns, and trends that suggest a relationship or an association.

We can perform bi-variate analysis for any combination of categorical and numerical variables. The combination can be:
| bi-variate variables   | Plot type |
| ------------- | ------------- |
| Categorical & Categorical| Stacked Bar Chart |
| Categorical & numerical  | scatter plot, histogram, box plot|
| numerical  & numerical  | Scatter plot, line chart| 


Multivariate Analysis:
- Heat map
- Bar Chart
- Scatter Chart
- Line Chart

**Categorical & Categorical --> (Stacked Column Chart)**

**Categorical & numerical --> (scatter plot, histogram, box plot)**

**numerical & numerical --> (Scatter plot, line chart)**

We could also use a correlation matrix to get more specific information about the relationship between these two variables.